In [1]:
import pandas as pd
file = './DATA/movies.csv'
movies = pd.read_csv(file, index_col = 'Title')
movies.head()

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

In [2]:
#데이터 그룹화 51p
# 과제 - 어떤 제작사가 제작한 영화의 총 수익이 가장 높은지 알아보기
# - Gross 열의 값을 제작사별로 집계.

In [10]:
movies['Gross'] = movies['Gross'].str.replace('$', '', regex = False).str.replace(',', '', regex = False).astype(float)

In [11]:
movies['Gross'].mean()

439.0308184143222

In [14]:
#제작사 식별 -> 제작사에 속한 영화, 행을 버킷으로 지정.
studios = movies.groupby('Studio')
studios.count().head()

                        Rank  Gross  Year
Studio
Artisan                    1      1     1
Buena Vista              125    125   125
CL                         1      1     1
China Film Corporation     1      1     1
Columbia                   5      5     5

In [15]:
movies['Gross'].apply(func = round)

Title
Avengers: Endgame               2796
Avatar                          2790
Titanic                         2188
Star Wars: The Force Awakens    2068
Avengers: Infinity War          2048
                                ...
Yogi Bear                        202
Garfield: The Movie              201
Cats & Dogs                      201
The Hunt for Red October         200
Valkyrie                         200
Name: Gross, Length: 782, dtype: int64

In [16]:
superheroes = ['Batman', 'Superman', 'Spider-Man', 'Iron Man', 'Captain America', 'Wonder Woman']
strength_levels = (100, 120, 90, 95, 110, 120)

In [17]:
super = pd.Series(superheroes)

In [18]:
super

0             Batman
1           Superman
2         Spider-Man
3           Iron Man
4    Captain America
5       Wonder Woman
dtype: object

In [19]:
strength = pd.Series(strength_levels)
strength

0    100
1    120
2     90
3     95
4    110
5    120
dtype: int64

In [27]:
DF = pd.DataFrame(index = super, data = strength_levels)

In [28]:
DF.head(2)

            0
Batman    100
Superman  120

In [31]:
DF.count()

0    6
dtype: int64